TexasInstruments/mcupsdk-core/examples/drivers/edma/edma_multimem_transfer/am263px-lp/r5fss0-0_nortos/example.syscfg
epwm5.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm5.epwmTimebase_phaseEnable                                 = true;
epwm5.epwmCounterCompare_cmpA                                  = 1500;
epwm5.epwmCounterCompare_cmpB                                  = 8000;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD  = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmTimebase_period                                      = 24000;
epwm5.epwmTimebase_syncOutPulseMode                            = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm5.$name                                                    = "EPWM_before_DEL";
epwm5.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                  = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm5.epwmEventTrigger_enableInterrupt                         = true;
epwm5.EPWM.$assign                                             = "EPWM9";

epwm6.$name                                                    = "CONFIG_EPWM5";
epwm6.epwmTimebase_period                                      = 24000;
epwm6.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm6.epwmCounterCompare_cmpA                                  = 1500;
epwm6.epwmCounterCompare_cmpB                                  = 8000;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD  = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmDE_enableMode                                        = true;
epwm6.epwmDE_TripL                                             = "EPWM_DE_TRIP_SRC_INPUTXBAR_OUT1";
epwm6.epwmDE_TripSelA                                          = "EPWM_DE_TRIPH";
epwm6.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm6.epwmTimebase_phaseEnable                                 = true;
epwm6.epwmDE_reEntryDelay                                      = 8;
epwm6.EPWM.$assign                                             = "EPWM11";

epwm7.$name                                                    = "CONFIG_EPWM6";
epwm7.epwmTimebase_period                                      = 24000;
epwm7.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm7.epwmCounterCompare_cmpA                                  = 1500;
epwm7.epwmCounterCompare_cmpB                                  = 8000;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD  = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmDE_enableMode                                        = true;
epwm7.epwmDE_TripL                                             = "EPWM_DE_TRIP_SRC_INPUTXBAR_OUT1";
epwm7.epwmDE_TripSelA                                          = "EPWM_DE_TRIPH";
epwm7.epwmDE_IncrementStep                                     = 20;
epwm7.epwmTimebase_phaseEnable                                 = true;
epwm7.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm7.epwmDE_TripMonitorMode                                   = true;
epwm7.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                  = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm7.epwmTripZone_tzInterruptSource                           = ["EPWM_TZ_INTERRUPT_DCAEVT1"];
epwm7.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                    = "EPWM_TZ_ACTION_DISABLE";
epwm7.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                    = "EPWM_TZ_ACTION_DISABLE";
epwm7.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                = "EPWM_TZ_ACTION_DISABLE";
epwm7.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm7.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                = "EPWM_TZ_ACTION_DISABLE";
epwm7.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm7.epwmDE_selectMode                                        = "EPWM_DIODE_EMULATION_OST";
epwm7.epwmDE_Threshold                                         = 200;
epwm7.EPWM.$assign                                             = "EPWM12";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "ball.A7";
debug_log.uartLog.UART.TXD.$assign = "ball.A6";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

epwm_xbar1.$name                    = "CONFIG_EPWM_XBAR0";
epwm_xbar1.xbarOutput               = ["GPIO120"];
epwm_xbar1["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR3";
epwm_xbar1["xbarConfig-0"].instance = "INPUT_XBAR_2";

icl_xbar1.$name      = "CONFIG_ICL_XBAR0";
icl_xbar1.xbarOutput = ["MDL1_OUTA"];

input_xbar1.$name      = "CONFIG_INPUT_XBAR0";
input_xbar1.xbarOutput = "GPIO43";

input_xbar2.$name      = "CONFIG_INPUT_XBAR1";
input_xbar2.instance   = "INPUT_XBAR_1";
input_xbar2.xbarOutput = "GPIO45";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["EPWM0_INT"];

int_xbar2.$name      = "CONFIG_INT_XBAR1";
int_xbar2.xbarOutput = ["EPWM1_INT"];
int_xbar2.instance   = "INT_XBAR_1";

int_xbar3.$name      = "CONFIG_INT_XBAR2";
int_xbar3.xbarOutput = ["EPWM6_TZINT"];
int_xbar3.instance   = "INT_XBAR_2";

output_xbar1.$name            = "CONFIG_OUTPUT_XBAR0";
output_xbar1.xbarOutput       = ["EPWM4_SYNCOUT"];
output_xbar1.xbarConfig.$name = "CONFIG_EPWM_SYNCOUT_XBAR0";

output_xbar2.$name      = "CONFIG_OUTPUT_XBAR1";
output_xbar2.xbarOutput = ["DEL6_TRIP"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution                    = "ball.B2";
epwm1.EPWM.B.$suggestSolution                    = "ball.B1";
epwm2.EPWM.A.$suggestSolution                    = "ball.D3";
epwm3.EPWM.A.$suggestSolution                    = "ball.C2";
epwm3.EPWM.B.$suggestSolution                    = "ball.C1";
epwm4.EPWM.A.$suggestSolution                    = "ball.E2";
epwm4.EPWM.B.$suggestSolution                    = "ball.E3";
epwm5.EPWM.A.$suggestSolution                    = "ball.G1";
epwm5.EPWM.B.$suggestSolution                    = "ball.H2";
epwm6.EPWM.A.$suggestSolution                    = "ball.H1";
epwm6.EPWM.B.$suggestSolution                    = "ball.J2";
epwm7.EPWM.A.$suggestSolution                    = "ball.K2";
epwm7.EPWM.B.$suggestSolution                    = "ball.J1";
debug_log.uartLog.UART.$suggestSolution          = "UART0";
output_xbar1.OUTPUTXBAR.$suggestSolution         = "OUTPUTXBAR0";
output_xbar1.OUTPUTXBAR.XBAROUT.$suggestSolution = "ball.C9";
output_xbar2.OUTPUTXBAR.$suggestSolution         = "OUTPUTXBAR0";
output_xbar2.OUTPUTXBAR.XBAROUT.$suggestSolution = "ball.R3";
